[BalanceDefs.M_MothersDayGift MissionDefinition]
MissionName="Happy Mother's Day to you"
MissionDescription="I received a gift for Mother's Day Unfortunately, it can only be opened with the fingerprint of the receipt, it must be found if we want to see what's in Taggart's field."
TurnInDescription="This is the Oedipal dilemma and the rest is meaningless.."
MissionSummary="Open a gift for Taggart's mother.."
MissionGiver="The surprise box"
MissionTurnInLocation="From Taggart"
TeaserText="What's in the box??"

[BalanceDefs.M_MothersDayGift:FindLocketOnlySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_MothersDayGift:KillHenryGetLocketSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_MothersDayGift:KillHenryMinions MissionObjectiveDefinition]
ProgressMessage="The soldier who killed Henry"

[BalanceDefs.M_MothersDayGift:MinionObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_MothersDayGift:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_MothersDayGift:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_MothersDayGift:MothersDayGift_FindHenry MissionObjectiveDefinition]
ProgressMessage="He found Henry's bed."

[BalanceDefs.M_MothersDayGift:MothersDayGift_KillHenry MissionObjectiveDefinition]
ProgressMessage="kill henry"

[BalanceDefs.M_MothersDayGift:MothersDayGift_OpenBox MissionObjectiveDefinition]
ProgressMessage="Taggart's chest was cut open"

[BalanceDefs.M_MothersDayGift:MothersDayGift_PickUpFist MissionObjectiveDefinition]
ProgressMessage="Taggart's hand"

